<pad>	0
</s>	0
<unk>	0
<s>	0
<bos>	0
<eos>	0
=	0
2	0
+	0
4	0
-	0
<math>	0
<test>	0
<mask>	0
<sep>	0
<cls>	0
<number>	0
<operator>	0
<equals>	0
at	-0
▁t	-1
is	-2
▁a	-3
▁1	-4
mat	-5
▁is	-6
he	-7
▁5	-8
▁s	-9
en	-10
er	-11
fo	-12
ic	-13
le	-14
qu	-15
ro	-16
for	-17
▁for	-18
▁the	-19
el	-20
io	-21
mu	-22
ns	-23
pp	-24
ri	-25
xi	-26
▁*	-27
▁/	-28
▁3	-29
▁8	-30
▁b	-31
▁e	-32
▁o	-33
ely	-34
qua	-35
▁	-36
a	-37
e	-38
t	-39
i	-40
s	-41
o	-42
r	-43
m	-44
1	-45
h	-46
n	-47
.	-48
5	-49
c	-50
l	-51
p	-52
^	-53
u	-54
3	-55
8	-56
:	-57
b	-58
f	-59
x	-60
y	-61
6	-62
7	-63
q	-64
(	-65
)	-66
*	-67
/	-68
0	-69
9	-70
g	-71
w	-72
'	-73
,	-74
?	-75
d	-76
k	-77
z	-78
±	-79
√	-80
