{
    "model_type": "vishwamai",
    "architectures": ["VishwamaiModel"],
    "vocab_size": 64000,
    "hidden_size": 8192,
    "intermediate_size": 32768,
    "num_attention_heads": 64,
    "num_hidden_layers": 120,
    "max_position_embeddings": 8192,
    "tree_depth": 8,
    "branch_factor": 32,
    "use_conceptual_tokens": true,
    "concept_embedding_size": 512,
    "use_fp8": true,
    "attention_dropout": 0.05,
    "hidden_dropout": 0.05,
    "max_concepts_per_token": 12,
    "initializer_range": 0.02,
    "layer_norm_epsilon": 1e-5,
    "use_cache": true,
    "pad_token_id": 0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "tie_word_embeddings": true,
    "rope_scaling": {
        "type": "linear",
        "factor": 1.0
    },
    "attention_config": {
        "use_flash_attention": true,
        "attention_softmax_in_fp32": true,
        "fused_qkv": true,
        "use_memory_efficient_attention": true
    },
    "training_config": {
        "learning_rate": 1e-5,
        "weight_decay": 0.1,
        "beta1": 0.9,
        "beta2": 0.95,
        "grad_clip": 1.0,
        "warmup_steps": 5000
    }
}
