{
    "model_type": "vishwamai",
    "architectures": ["VishwamaiModel"],
    "vocab_size": 64000,
    "hidden_size": 8192,
    "intermediate_size": 32768,
    "num_attention_heads": 64,
    "num_hidden_layers": 120,
    "max_position_embeddings": 32768,
    "tree_depth": 8,
    "branch_factor": 32,
    "use_conceptual_tokens": true,
    "concept_embedding_size": 512,
    "use_fp8": true,
    "attention_dropout": 0.05,
    "hidden_dropout": 0.05,
    "max_concepts_per_token": 12,
    "initializer_range": 0.02,
    "layer_norm_epsilon": 1e-5,
    "use_cache": true,
    "pad_token_id": 0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "tie_word_embeddings": true,
    "rope_scaling": {
        "type": "linear",
        "factor": 1.0
    },
    "attention_config": {
        "use_flash_attention": true,
        "attention_softmax_in_fp32": true,
        "fused_qkv": true,
        "use_memory_efficient_attention": true
    },
    "training_config": {
        "learning_rate": 1.2e-4,
        "weight_decay": 0.01,
        "beta1": 0.9,
        "beta2": 0.95,
        "grad_clip": 1.0,
        "warmup_steps": 1000
    },
    "colab_specific": {
        "A100_optimized": {
            "batch_size": 4,
            "gradient_accumulation": 4,
            "memory_size": 2048,
            "tree_beam_width": 4,
            "use_flash_attention": true,
            "use_memory_efficient_attention": true,
            "gradient_checkpointing": true,
            "bf16": true,
            "fp16": false
        },
        "V100_optimized": {
            "batch_size": 2,
            "gradient_accumulation": 8,
            "memory_size": 1024,
            "tree_beam_width": 2,
            "use_flash_attention": true,
            "use_memory_efficient_attention": true,
            "gradient_checkpointing": true,
            "bf16": false,
            "fp16": true
        },
        "T4_optimized": {
            "batch_size": 1,
            "gradient_accumulation": 16,
            "memory_size": 512,
            "tree_beam_width": 1,
            "use_flash_attention": false,
            "use_memory_efficient_attention": true,
            "gradient_checkpointing": true,
            "bf16": false,
            "fp16": true
        }
    }
}
