<pad>	0
</s>	0
<unk>	0
<s>	0
<bos>	0
<eos>	0
=	0
2	0
+	0
4	0
-	0
<mask>	0
<sep>	0
<cls>	0
<number>	0
<operator>	0
<equals>	0
at	-0
▁t	-1
is	-2
▁a	-3
▁1	-4
mat	-5
▁is	-6
he	-7
▁5	-8
▁s	-9
en	-10
er	-11
fo	-12
ic	-13
le	-14
qu	-15
ro	-16
for	-17
▁for	-18
▁the	-19
el	-20
io	-21
mu	-22
ns	-23
pp	-24
ri	-25
xi	-26
▁*	-27
▁/	-28
▁3	-29
▁8	-30
▁b	-31
▁e	-32
▁o	-33
ely	-34
qua	-35
atio	-36
ppro	-37
▁	-38
a	-39
e	-40
t	-41
i	-42
s	-43
o	-44
r	-45
m	-46
1	-47
h	-48
n	-49
.	-50
5	-51
c	-52
l	-53
p	-54
^	-55
u	-56
3	-57
8	-58
:	-59
b	-60
f	-61
x	-62
y	-63
6	-64
7	-65
q	-66
(	-67
)	-68
*	-69
/	-70
0	-71
9	-72
g	-73
w	-74
'	-75
,	-76
?	-77
d	-78
k	-79
z	-80
±	-81
√	-82
