{
  "vocab_size": 100,
  "model_prefix": "vishwamai",
  "pad_id": 0,
  "eos_id": 1,
  "unk_id": 2,
  "bos_id": 3,
  "character_coverage": 0.9999,
  "model_type": "bpe",
  "special_tokens": {
    "<pad>": 0,
    "<eos>": 1,
    "<unk>": 2,
    "<bos>": 3,
    "<mask>": 4,
    "<sep>": 5,
    "<cls>": 6,
    "<number>": 7,
    "<operator>": 8,
    "<equals>": 9
  }
}